[EN]
Introduction=Starting with release 2.6, Jona, the virtual race engineer, collects data from your races and saves them together with the associated setup, air and asphalt temperature and other environmental conditions in a local database. This information can then be used as a starting point for a setup in a future race under the same or similar conditions. In order to build up a comprehensive collection of data on vehicles, tracks and environmental conditions as quickly as possible, Jona can integrate your data with the data of all other drivers, and in return will make the consolidated database available to all contributors.`n`nWhen your data is transferred, no direct or indirect personal data is involved. It is not possible to draw any conclusions about the individual user or the computers from which the data originated. A randomly generated key is used to identify the local database and the data supplied for further processing.
Information=Please note, that your answer is saved in the "CONSENT" file in the "Simulator Controller\Config" directory which is located in your user Documents folder. If you want to change your consent in the future, delete this file and this dialog will appear again.
Warning=Important: It is more than necessary, that you have supplied the correct setup information to Jona, before starting a race. Otherwise the recorded data will be corrupted and will lead to false information in the consolidated database as well. You will find comprehensive information about this in the <a href\<>"https://github.com/SeriousOldMan/Simulator-Controller/wiki/Virtual-Race-Engineer#racing-with-jona">documentation</a>.
[DE]
Introduction=Ab dem Release 2.6 sammelt Jona, der virtuelle Renningenieur, Daten von jedem Rennen und speichert diese zusammen mit dem zugehörigen Setup, sowie den Luft- und Asphalttemperaturen und anderen Streckenbedingungen, in einer lokalen Datenbank ab. Diese Informationen können bei einem zukünftigen Rennen bei gleichen oder ähnlichen Bedingungen als Ausgangsbasis für ein Setup herangezogen werden. Um möglichst schnell eine umfassende Datensammlung von Fahrzeugen, Strecken und Rahmenbedingungen aufzubauen, kann Jona diese Daten mit den Daten aller anderen Fahrer abgleichen, ergänzen und im Gegenzug allen zur Verfügung stellen, die beim Aufbau der Datenbasis unterstützt haben. Jeder, der sich so bei dem Aufbau dieser Datensammlung beteiligt, erhält somit auch Zugriff auf die Datensammlungen aller anderen Nutzer.`n`nBei dem Austausch der Daten werden keine direkten oder indirekten personenbezogenen Daten übertragem. Ein Rückschluss auf Personen oder die Rechner, von denen die Daten stammen, ist nicht möglich. Zur Identifikation wird ein zufällig generierter Schlüssel verwendet, der die lokale Datenbank und die gelieferten Daten für die weitere Verarbeitung identifiziert.
Information=Bitte beachten Sie, dass Ihre Antwort in der Datei "CONSENT" im Verzeichnis "Simulator Controller\Config" gespeichert wird, welches sich seinerseits in Ihrem Benutzer Dokumente Ordner befindet. Wenn Sie Ihre Einwilligung in Zukunft ändern möchten, löschen Sie diese Datei, und dieser Dialog wird erneut angezeigt.
Warning=Wichtig: Es ist mehr als notwendig, dass Sie Jona die richtigen Setup-Informationen zur Verfügung gestellt haben, bevor Sie in ein Rennen starten. Andernfalls werden die aufgezeichneten Informationen verfälscht und diese führen dann in Folge auch zu falschen Informationen in der konsolidierten Datenbank. Umfassende Informationen hierzu finden Sie in der <a href\<>"https://github.com/SeriousOldMan/Simulator-Controller/wiki/Virtual-Race-Engineer#racing-with-jona">Dokumentation</a>.